//#include <iostream>

//using namespace std;
////10
////10. Пользователь вводит с клавиатуры объем флешки в гигабайтах.Посчитать, сколько на нее поместится фильмов размером 760 Мбайт.
//
//int main() {
//	std::cout << "pls write flash drive capacity in gigabytes: " ;
//	int flash_drive;
//	std::cin >> flash_drive;
//	flash_drive *= 1000;
//	std::cout << "on yor flash drive can be download: "<< (flash_drive - (flash_drive % 760)) / 760 << " film and change will be: " << flash_drive % 760 << std::endl;
//
//}