//#include <iostream>

//using namespace std;
//////12
////Пользователь вводит с клавиатуры количество студентов, сдавших экзамен, и количество «должников».
//// Посчитать, сколько процентов составляют «должники» от общего числа студентов, а также, сколько процентов составляют студенты, сдавшие экзамен.
//
//int main() {
//	std::cout << "enters from the keyboard the number of students who passed the exam and the number of \"debtors\":" << std::endl;
//	std::cout << "Passed:";
//	double passed;
//	std::cin >> passed;
//	std::cout << "debtors:";
//	double debtors;
//	std::cin >> debtors;
//	std::cout << "Passed:" << (passed / (passed + debtors)) * 100 << "%" << std::endl;
//	std::cout << "Debtors:" << (debtors / (passed + debtors)) * 100 << "%" << std::endl;
//}