//#include <iostream>

//using namespace std;
////7
////7. Пользователь вводит с клавиатуры стоимость одного ноутбука, их количество и процент скидки.Посчитать общую сумму заказа.
//int main() {
//	std::cout << "pls write  cost of one laptop, their quantity and discount percentage " << std::endl;
//	std::cout << "cost of one laptop:";
//	int cost;
//	std::cin >> cost;
//	std::cout << "quantity:";
//	int quantity;
//	std::cin >> quantity;
//	std::cout << "discount percentage:";
//	int discount_percentage;
//	std::cin >> discount_percentage;
//	cost = cost - (cost / 100) * discount_percentage;
//	std::cout << "end price:" << cost * quantity;
//}