//#include <iostream>
//using namespace std;
////11
////11. Пользователь вводит с клавиатуры дробное число. Округлить его до двух знаков после запятой и вывести на экран. .
//
//int main() {
//	std::cout << "pls write pls write any float number: ";
//	double value;
//	std::cin >> value;
//	value *= 100;
//	int value1 = value;
//	std::cout << (double)value1/100 << std::endl;
//
//}