//#include <iostream>

//using namespace std;
//////13
////Пользователь вводит с клавиатуры количество студентов, сдавших экзамен, и количество «должников».
//// Посчитать, сколько процентов составляют «должники» от общего числа студентов, а также, сколько процентов составляют студенты, сдавшие экзамен.
//
//int main() {
//	std::cout << "pls write time in seconds elapsed since the beginning of the day:";
//	int time;
//	std::cin >> time;
//	time = 86400 - time;
//	int hours = time / 3600;
//	int minutes = (time % 3600) / 60;
//	int seconds = time % 60;
//	std::cout << "time to the end of ths day: " << " h: " << hours << " m: " << minutes << " s: " << seconds ;
//}