//#include <iostream>

//using namespace std;
////8
////8. Зарплата менеджера составляет 100$ + 5 % от продаж.
////Пользователь вводит с клавиатуры общую сумму сделок менеджера за месяц.Посчитать итоговую зарплату менеджера.
//
//int main() {
//	std::cout << "enters the total amount of the manager's transactions for the month from the keyboard:";
//	double transactions;
//	std::cin >> transactions;
//	std::cout << "The manager's salary is:" << 100 + (transactions / 100) * 5 << "$" << std::endl;
//
//}